[
    {
        "title": "Julian Korf de Gidts, aangenaam",
        "contentType": "generalInfo",
        "text": "Ik ben een enthousiaste en leergierige student HBO-ICT op de HAN in Nijmegen. Ik specialiseer mij binnen mijn studie HBO-ICT in de richting van web development. Op deze website stel ik mij graag aan u voor",
        "img": "julian.png"
    },
    {
        "title": "Wie ben ik?",
        "text": "Ik ben Julian Korf de Gidts, 20 jaar en fulltime student. Ik ben woonachtig in Huissen. Ik heb al van jongs af aan een passie voor technologie en alles wat daar mee te maken heeft. Het was dan ook een logische keuze om een ICT opleiding te gaan volgen. Ik ben altijd op zoek naar nieuwe uitdagingen en ervaringen... blablabla",
        "img": "",
        "list": [
            "option one",
            "option two",
            "option three"
        ]
    },
    {
        "title": "Mijn ervaring",
        "contentType": "listTable",
        "listTable": [
            {
                "topic": "Studentassistent",
                "title": "Studentassistent",
                "companyName": "Hogeschool van Arnhem en Nijmegen",
                "yearStart": "september 2019",
                "yearEnd": "heden",
                "subText": "Als studentassistent ondersteun ik de docenten van het vak DWA (Develop a Web Application) bij het nakijken van opdrachten die de studenten wekelijks inleveren. Het gaat hierbij om opdrachten waarbij studenten hun kennis over o.a. React en NodeJS aantonen"
            },
            {
                "topic": "Ziekenhuis Rijnstate",
                "title": "Medewerker Patiëntenvervoer en Beddencentrale",
                "companyName": "Ziekenhuis Rijnstate",
                "yearStart": "juni 2016",
                "yearEnd": "heden",
                "subText": "Als medewerker patiëntenvervoer transporteer ik patiënten die opgenomen zijn in het ziekenhuis van en naar afdelingen en poliklinieken. Hierbij staan respect, aandacht en gastvrijheid voor de patiënt centraal. Als medewerker beddencentrale beheer ik samen met mijn collega's de beddencentrale in het ziekenhuis, maak ik ziekenhuisbedden schoon en lever ik diverse soorten materialen uit aan afdelingen"
            },
            {
                "topic": "Uw Computerstudent",
                "title": "Computerspecialist",
                "companyName": "Uw Computerstudent",
                "yearStart": "mei. 2017",
                "yearEnd": "nov 2017",
                "subText": "Als computerstudent heb ik klanten in de regio Arnhem e.o. aan huis geholpen met diverse technische problemen aan computers, telefoons, tablets en netwerkapparatuur"
            }
        ]
    },
    {
        "title": "Mijn projecten",
        "contentType": "projectsOverview",
        "projectsOverview": [
            {
                "title": "Studiesuccess voorspellen met Machine Learning",
                "year": "2019 - 2020, 6 mnd",
                "tech": "Machine Learning | Python | RUP",
                "subText": "Op dit moment ben ik bezig met een project waarbij ik met vier anderen ga onderzoeken of en hoe we AI kunnen laten voorspellen wat de kans is dat nieuwe HBO-ICT studenten aan de ICA (Informatica en Communicatie Academie) het propedeusejaar niet halen. Hierbij wordt gekeken naar zaken als cijferlijst van de vooropleiding, achtergrond en interesse in ICT. Voor iedere student kan zo een score gevormd worden die de kans op success aangeeft. De opleiding kan met deze informatie risicostudenten aanvullende begeleiding bieden"
            },
            {
                "title": "PostIT",
                "year": "2019, 3 mnd",
                "tech": "React | Redux | NodeJs | Express | WebSockets | Web Push",
                "subText": "Voor een project heb ik samen met twee anderen PostIT ontwikkeld. PostIT is een digitale en interactieve ideeënbus waar medewerkers van bedrijven op een laagdrempelige manier hun ideeën kunnen delen met collega's. De opzet is vergelijkbaar met de zakelijke chatapplicatie Slack, iedere organisatie heeft zijn eign 'space' met een eigen URL"
            },
            {
                "title": "CV-webapp",
                "year": "2019",
                "tech": "React",
                "subText": "Ik heb in mijn vrije tijd deze webapp gebouwd zodat ik mijzelf op een originele manier kan presenteren aan stageaanbieders en werkgevers"
            },
            {
                "title": "Project Unicus",
                "year": "2018 - 2019, 3 mnd",
                "tech": "Kotlin | KMongo | Spring Boot | Angular | MongoDB | Levenshtein-algorithm | Scrum",
                "subText": "Voor een externe opdrachtgever heb ik samen met drie anderen Unicus ontwikkeld. Unicus is een applicatie die gegevens uit een notariële database van de opdrachtgever kan doorzoeken en mogelijk dubbele records hieruit kan filteren. Hierbij wordt een eigen implementatie van het Levenshtein-algoritme gebruikt. Het presenteert deze resultaten aan de gebruiker welke vervolgens met deze applicatie de gevonden dubbele records kan samenvoegen tot 1 record"
            }
        ]
    },
    {
        "title": "Mijn opleiding",
        "contentType": "listTable",
        "listTable": [
            {
                "topic": "HBO-ICT",
                "title": "HBO-ICT",
                "companyName": "Hogeschool van Arnhem en Nijmegen",
                "yearStart": "2017",
                "yearEnd": "2021",
                "subText": "Ik volg op dit moment de studie HBO-ICT aan de HAN in Nijmegen. Ik zit nu in mijn derde jaar van deze studie. Ik heb mijn propedeuse in een keer behaald en ben mij daarna vanaf het tweede jaar gaan specialiseren in Web Development. Ik verwacht in 2021 af te studeren"
            },
            {
                "topic": "IVK",
                "title": "Integrale Veiligheidskunde",
                "companyName": "Saxion Hogeschool",
                "yearStart": "2016",
                "yearEnd": "2017",
                "subText": "Ik heb een jaar lang de opleiding Integrale Veiligheidskunde gevolgd op Saxion Hogeschool te Deventer. Na driekwart jaar kwam ik tot de conclusie dat deze opleiding niet goed bij mij paste. Ik ben daaropvolgend na het behalen van mijn propedeuse gestopt met deze opleiding"
            },
            {
                "topic": "HAVO",
                "title": "Hoger Algemeen Voortgezet Onderwijs",
                "companyName": "Lorentz Lyceum",
                "yearStart": "2010",
                "yearEnd": "2016",
                "subText": "Ik heb in 5 jaar tijd mijn HAVO-diploma behaald op het Lorentz Lyceum te Arnhem"
            }
        ]
    },
    {
        "title": "Hobby's en nevenactiviteiten",
        "contentType": "listTable",
        "listTable": [
            {
                "topic": "Activiteiten m.b.t. studie",
                "title": "Activiteiten m.b.t. studie",
                "companyName": "Hogeschool van Arnhem en Nijmegen, Studievereniging Xtend",
                "yearStart": "2018",
                "yearEnd": "heden",
                "subText": "Ik help jaarlijks bij de HAN open dagen, ICA presents en de studiekeuzecheck van mijn opleiding. Ook heb ik in 2019 voor het eerst geholpen bij de introductieweek voor de eerstejaars"
            },
            {
                "topic": "DJ, licht en geluid",
                "title": "DJ, licht en geluid",
                "companyName": "DJ Himes",
                "yearStart": "2013",
                "yearEnd": "heden",
                "subText": "Ik help een bekende van mij regelmatig bij het opbouwen, draaien/bedienen en afbouwen van licht en geluid op evenementen"
            },
            {
                "topic": "Airsoft",
                "title": "Airsoft",
                "companyName": "hobby",
                "yearStart": "2017",
                "yearEnd": "heden",
                "subText": "Ik speel in mijn vrije tijd graag de militaire simulatiesport Airsoft"
            }
        ]
    },
    {
        "title": "Contact",
        "contentType": "generalInfo",
        "text": "En, heb ik uw interesse gewekt? Zo ja dan kom ik graag met u in contact. U kunt u mij op de volgende manieren bereiken:",
        "img": "",
        "list": [
            "option one",
            "option two",
            "option three"
        ]
    }
]